Autodesk.Revit.DB.NurbsSurfaceData.GetWeight(System.Int32)
Get the weight.
idx:
The index of the weight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Out-of-range access.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetNumberOfWeights
Get the number of weights.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetControlPoint(System.Int32)
Get the list of control points.
idx:
The index of the control point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Out-of-range access.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetNumberOfControlPoints
Get the number of control points.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetKnotV(System.Int32)
Get the knot in the v-direction.
idx:
The index of the knot.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Out-of-range access.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetNumberOfKnotsV
Get the number of knots in the v-direction.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetKnotU(System.Int32)
Get the knot in the u-direction.
idx:
The index of the knot.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Out-of-range access.
Since:
2026

Autodesk.Revit.DB.NurbsSurfaceData.GetNumberOfKnotsU
Get the number of knots in the u-direction.
Since:
2026